uhnp/src/InformationRegisters/тн_ОбработчикиОбновления/тн_ОбработчикиОбновления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ОбработчикиОбновления</name>
  <comment>Урубков И. 28.05.2025 Выполнение задач №000053788</comment>
  <resources>
    <name>ВРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВыполненияОбработчика</name>
    <comment>// Урубков И. 02.09.2025 Выполнение задач №000054387</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Процедура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_ОбработчикиОбновления/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСобытиеУспешногоВыполнения(Обработчик) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТН_ОбработчикиОбновления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Процедура.Установить(Обработчик.Процедура);
	НаборЗаписей.Отбор.НомерВЗ.Установить(Обработчик.НомерВЗ);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	Запись.Процедура = Обработчик.Процедура;
	Запись.НомерВЗ = Обработчик.НомерВЗ;
	Запись.Выполнено = Истина;
	Запись.ВРаботе = Ложь;
	Запись.ТекстОшибки = "";
	Запись.ДатаОбработки = ТекущаяДатаСеанса();
	
	// НАЧАЛО Урубков И. 02.09.2025 Выполнение задач №000054387
	Запись.ВерсияВыполненияОбработчика = Метаданные.Версия;
	// КОНЕЦ Урубков И. 02.09.2025 Выполнение задач №000054387
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСобытиеОшибочногоВыполнения(Обработчик, ТекстОшибки) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТН_ОбработчикиОбновления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Процедура.Установить(Обработчик.Процедура);
	НаборЗаписей.Отбор.НомерВЗ.Установить(Обработчик.НомерВЗ);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	Запись.Процедура = Обработчик.Процедура;
	Запись.НомерВЗ = Обработчик.НомерВЗ;
	Запись.Выполнено = Ложь;
	Запись.ВРаботе = Ложь;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.ДатаОбработки = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСобытиеНачалаВыполнения(Обработчик) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТН_ОбработчикиОбновления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Процедура.Установить(Обработчик.Процедура);
	НаборЗаписей.Отбор.НомерВЗ.Установить(Обработчик.НомерВЗ);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Процедура = Обработчик.Процедура;
	Запись.НомерВЗ = Обработчик.НомерВЗ;
	Запись.Выполнено = Ложь;
	Запись.ВРаботе = Истина;
	Запись.ДатаНачалаВыполнения = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Урубков И. 02.09.2025 Выполнение задач №000054387
//
Функция ПолучитьВыполненныеОбработчики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТН_ОбработчикиОбновления.Процедура КАК Процедура,
		|	ТН_ОбработчикиОбновления.НомерВЗ КАК НомерВЗ
		|ИЗ
		|	РегистрСведений.ТН_ОбработчикиОбновления КАК ТН_ОбработчикиОбновления
		|ГДЕ
		|	ТН_ОбработчикиОбновления.Выполнено";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти
